In [6]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [7]:
# File Load
file_to_load = "Resources/purchase_data.csv"

In [8]:
# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [9]:
#check for dtypes for analysis 
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [10]:
# Display the total number of players (sorting by the SN col)
total_players= purchase_data.groupby('SN').count()

# find the number of total players
print('Total Players')
len(total_players.index)

Total Players

576

In [11]:
#number of unique items (by Item Name for different games)
game_titles=purchase_data['Item Name'].nunique()
game_titles

179

In [12]:
#average Price 
avg_price= purchase_data['Price'].mean()
avg_price

3.0509871794871795

In [13]:
#total Purchases (count of Purchase Id)
total_purch= purchase_data['Purchase ID'].count()
total_purch

780

In [14]:
# Total Revenue (sum of Price col)
total_rev= purchase_data['Price'].sum()
total_rev

2379.77

In [15]:
#PURCHASING ANALYSIS

# Print a Summary table of game_titles, avg_price, total_rev
data= [(game_titles, avg_price, total_purch, total_rev)]
summary_df=pd.DataFrame(data,columns= ['Number of Unique Items', 'Average Price', 'Number of Purchases', 'Total Revenue'])

#format the price and revenu columns to currency
summary_df['Average Price']=summary_df['Average Price'].map('${:,.2f}'.format)
summary_df['Total Revenue']=summary_df['Total Revenue'].map('${:,.2f}'.format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [16]:
#Groupby gender and find the count of each 
gender= purchase_data.groupby('Gender').count()
gender_1= gender.rename(columns= {'Purchase ID' : 'Total Count'})

#rename the columns
gender_2= gender_1.drop(columns=['SN','Age','Item ID','Item Name','Price'])
gender_2

                       Total Count
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [17]:
#GENDER DEMOGRAPHICS

#calculate and add the percentage to the total number of players
g_total= gender_2['Total Count'].sum()

#format to percentage
gender_2['Percentage of Players']= (gender_2['Total Count'] / g_total).astype(float).map("{:.2%}".format)
gender_2

                       Total Count Percentage of Players
Gender
Female                         113                14.49%
Male                           652                83.59%
Other / Non-Disclosed           15                 1.92%

In [18]:
# Purchasing Analysis by gender (purchase count, average purchase price, total purchase value)
grouped_purch= purchase_data.groupby('Gender').agg(count=pd.NamedAgg(column='Price', aggfunc='count'),
                                                   mean_price=pd.NamedAgg(column='Price', aggfunc='mean'),
                                                   total_price=pd.NamedAgg(column='Price', aggfunc='sum'))
grouped_purch.head()

                       count  mean_price  total_price
Gender
Female                   113    3.203009       361.94
Male                     652    3.017853      1967.64
Other / Non-Disclosed     15    3.346000        50.19

In [19]:
#rename columns
Purch_1= grouped_purch.rename(columns={'count': 'Purchase Count', 'mean_price':'Average Purchase Price', 'total_price' : 'Total Purchase Value'})
Purch_1

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [20]:
#PURCHASING ANALYSIS BY GENDER

#add the average price column
Purch_1['Avg Total Purchase per Person']= (Purch_1['Total Purchase Value'] / Purch_1['Purchase Count'])

#format the avg price, tota purchase value,  avg total per person
Purch_1['Average Purchase Price']=Purch_1['Average Purchase Price'].map('${:,.2f}'.format)
Purch_1['Total Purchase Value']=Purch_1['Total Purchase Value'].map('${:,.2f}'.format)
Purch_1['Avg Total Purchase per Person']=Purch_1['Avg Total Purchase per Person'].map('${:,.2f}'.format)
Purch_1

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$3.20
Male,652,$3.02,"$1,967.64",$3.02
Other / Non-Disclosed,15,$3.35,$50.19,$3.35

In [21]:
#age demographics (create the bins)
purchase_data['Age Ranges']= pd.cut(purchase_data['Age'], bins= [0,10,15,20,25,30,35,40,100], labels= ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+'])
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,15-19
778,778,Sisur91,7,Male,101,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [22]:
#create the aggregate chart for the ages based on the binning
grouped_age= purchase_data.groupby('Age Ranges').agg(count=pd.NamedAgg(column='Item ID', aggfunc='count'),
                                                   mean_price=pd.NamedAgg(column='Price', aggfunc='mean'),
                                                   total_price=pd.NamedAgg(column='Price', aggfunc='sum'))
grouped_age

            count  mean_price  total_price
Age Ranges
<10            32    3.405000       108.96
10-14          54    2.900000       156.60
15-19         200    3.107800       621.56
20-24         325    3.020431       981.64
25-29          77    2.875584       221.42
30-34          52    2.994423       155.71
35-39          33    3.404545       112.35
40+             7    3.075714        21.53

In [23]:
#rename the columns of the age aggregate dataframe
age_df= grouped_age.rename(columns={'count' : 'Purchase Count', 'mean_price':'Average Purchase Price', 'total_price' : 'Total Purchase Value'})
age_df

            Purchase Count  Average Purchase Price  Total Purchase Value
Age Ranges
<10                     32                3.405000                108.96
10-14                   54                2.900000                156.60
15-19                  200                3.107800                621.56
20-24                  325                3.020431                981.64
25-29                   77                2.875584                221.42
30-34                   52                2.994423                155.71
35-39                   33                3.404545                112.35
40+                      7                3.075714                 21.53

In [33]:
#AGE DEMOGRAPHICS

#add the avg column
age_df['Avg Total Purchase per Person']=(age_df['Total Purchase Value'] / age_df['Purchase Count'])
age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,32,3.405000,108.96,3.405000
10-14,54,2.900000,156.60,2.900000
15-19,200,3.107800,621.56,3.107800
20-24,325,3.020431,981.64,3.020431
25-29,77,2.875584,221.42,2.875584
30-34,52,2.994423,155.71,2.994423
35-39,33,3.404545,112.35,3.404545
40+,7,3.075714,21.53,3.075714

In [25]:
#top spenders aggregate chart (count, avg price, total purchase)
grouped_spenders= purchase_data.groupby('SN').agg(count=pd.NamedAgg(column='Item ID', aggfunc='count'),
                                                   mean_price=pd.NamedAgg(column='Price', aggfunc='mean'),
                                                   total_price=pd.NamedAgg(column='Price', aggfunc='sum'))
grouped_spenders

               count  mean_price  total_price
SN
Adairialis76       1    2.280000         2.28
Adastirin33        1    4.480000         4.48
Aeda94             1    4.910000         4.91
Aela59             1    4.320000         4.32
Aelaria33          1    1.790000         1.79
...              ...         ...          ...
Yathecal82         3    2.073333         6.22
Yathedeu43         2    3.010000         6.02
Yoishirrala98      1    4.580000         4.58
Zhisrisu83         2    3.945000         7.89
Zontibe81          3    2.676667         8.03

[576 rows x 3 columns]

In [26]:
#rename top spenders agg columns
spenders_df= grouped_spenders.rename(columns={'count' : 'Purchase Count', 'mean_price':'Average Purchase Price', 'total_price' : 'Total Purchase Value'})

#sort the total purchase column by descending value
spenders_df.sort_values(by='Total Purchase Value', ascending=False)

#reformat the avg purchase price and total purchase price value columns as currency format
spenders_df['Total Purchase Value']=spenders_df['Total Purchase Value'].map('${:,.2f}'.format)
spenders_df['Average Purchase Price']=spenders_df['Average Purchase Price'].map('${:,.2f}'.format)
spenders_df

               Purchase Count Average Purchase Price Total Purchase Value
SN
Adairialis76                1                  $2.28                $2.28
Adastirin33                 1                  $4.48                $4.48
Aeda94                      1                  $4.91                $4.91
Aela59                      1                  $4.32                $4.32
Aelaria33                   1                  $1.79                $1.79
...                       ...                    ...                  ...
Yathecal82                  3                  $2.07                $6.22
Yathedeu43                  2                  $3.01                $6.02
Yoishirrala98               1                  $4.58                $4.58
Zhisrisu83                  2                  $3.94                $7.89
Zontibe81                   3                  $2.68                $8.03

[576 rows x 3 columns]

In [34]:
#TOP SPENDERS 

#reorder chart by total purchase value (descending)
final_spenders= spenders_df.sort_values(by='Total Purchase Value', ascending=False)
final_spenders

              Purchase Count Average Purchase Price Total Purchase Value
SN
Haillyrgue51               3                  $3.17                $9.50
Phistym51                  2                  $4.75                $9.50
Lamil79                    2                  $4.64                $9.29
Aina42                     3                  $3.07                $9.22
Saesrideu94                2                  $4.59                $9.18
...                      ...                    ...                  ...
Qilalista41                1                  $1.02                $1.02
Ililsasya43                1                  $1.02                $1.02
Aidai61                    1                  $1.01                $1.01
Chanirra79                 1                  $1.01                $1.01
Alo38                      1                  $1.00                $1.00

[576 rows x 3 columns]

In [27]:
#MOST POPULAR ITEMS aggregate chart for purchase count and tota purchase values
grouped_pop= purchase_data.groupby('Item ID').agg(Purchase_Count=pd.NamedAgg(column='Item ID', aggfunc='count'),
                                                   Total_Purchase_Value=pd.NamedAgg(column='Price', aggfunc='sum'))
grouped_pop

         Purchase_Count  Total_Purchase_Value
Item ID
0                     4                  5.12
1                     3                  9.78
2                     6                 14.88
3                     6                 14.94
4                     5                  8.50
...                 ...                   ...
179                   6                 26.88
180                   1                  3.36
181                   5                  8.30
182                   3                 12.09
183                   3                  3.27

[183 rows x 2 columns]

In [28]:
#take the item names and individal prices from the original purchase data, drop uneeded col
purch_pop=purchase_data.drop(['Purchase ID','SN','Age','Gender', 'Age Ranges'], axis = 1)
purch_pop

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778      101                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [29]:
#merge the grouped_pop and purch_pop
pop_merge = grouped_pop.merge(purch_pop, on="Item ID")
pop_merge

     Item ID  Purchase_Count  Total_Purchase_Value            Item Name  Price
0          0               4                  5.12             Splinter   1.28
1          0               4                  5.12             Splinter   1.28
2          0               4                  5.12             Splinter   1.28
3          0               4                  5.12             Splinter   1.28
4          1               3                  9.78             Crucifer   3.26
..       ...             ...                   ...                  ...    ...
775      182               3                 12.09            Toothpick   4.03
776      182               3                 12.09            Toothpick   4.03
777      183               3                  3.27  Dragon's Greatsword   1.09
778      183               3                  3.27  Dragon's Greatsword   1.09
779      183               3                  3.27  Dragon's Greatsword   1.09

[780 rows x 5 columns]

In [30]:
#reset index as item id of the merged df and drop all duplicate rows
pop_reindex= pop_merge.set_index('Item ID')
pop_df= pop_reindex.drop_duplicates()
pop_df

,Purchase_Count,Total_Purchase_Value,Item Name,Price
Item ID,,,,
0,4,5.12,Splinter,1.28
1,3,9.78,Crucifer,3.26
2,6,14.88,Verdict,2.48
3,6,14.94,Phantomlight,2.49
4,5,8.50,Bloodlord's Fetish,1.70
...,...,...,...,...
179,6,26.88,"Wolf, Promise of the Moonwalker",4.48
180,1,3.36,Stormcaller,3.36
181,5,8.30,Reaper's Toll,1.66
182,3,12.09,Toothpick,4.03
183,3,3.27,Dragon's Greatsword,1.09

In [31]:
#MOST POPULAR

#order by deceasing value for purchase count col
final_pop= pop_df.sort_values(by='Purchase_Count', ascending=False)
final_pop

,Purchase_Count,Total_Purchase_Value,Item Name,Price
Item ID,,,,
178,12,50.76,"Oathbreaker, Last Hope of the Breaking Storm",4.23
145,9,41.22,Fiery Glass Crusader,4.58
108,9,31.77,"Extraction, Quickblade Of Trembling Hands",3.53
82,9,44.10,Nirvana,4.90
19,8,8.16,"Pursuit, Cudgel of Necromancy",1.02
...,...,...,...,...
104,1,1.93,Gladiator's Glaive,1.93
23,1,1.99,Crucifer,1.99
180,1,3.36,Stormcaller,3.36
91,1,4.17,Celeste,4.17
134,1,4.50,Undead Crusader,4.50

In [32]:
#MOST PROFITABLE

#order by decreasing value for purchase value col
final_pop= pop_df.sort_values(by='Total_Purchase_Value', ascending=False)
final_pop.head()

,Purchase_Count,Total_Purchase_Value,Item Name,Price
Item ID,,,,
178,12,50.76,"Oathbreaker, Last Hope of the Breaking Storm",4.23
82,9,44.10,Nirvana,4.90
145,9,41.22,Fiery Glass Crusader,4.58
92,8,39.04,Final Critic,4.88
103,8,34.80,Singed Scalpel,4.35

In [ ]:
#see .txt file for conclusion